{
  "architectures": [
    "BlipForConditionalGeneration"
  ],
  "dtype": "float32",
  "image_text_hidden_size": 256,
  "initializer_factor": 1.0,
  "initializer_range": 0.02,
  "label_smoothing": 0.0,
  "logit_scale_init_value": 2.6592,
  "model_type": "blip",
  "projection_dim": 512,
  "text_config": {
    "add_cross_attention": false,
    "attention_probs_dropout_prob": 0.0,
    "bos_token_id": 30522,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "dtype": "float32",
    "encoder_hidden_size": 768,
    "eos_token_id": 2,
    "finetuning_task": null,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.0,
    "hidden_size": 768,
    "initializer_factor": 1.0,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "is_decoder": true,
    "label_smoothing": 0.0,
    "layer_norm_eps": 1e-12,
    "max_position_embeddings": 512,
    "model_type": "blip_text_model",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "pad_token_id": 0,
    "prefix": null,
    "projection_dim": 768,
    "pruned_heads": {},
    "sep_token_id": 102,
    "task_specific_params": null,
    "tf_legacy_loss": false,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null,
    "torchscript": false,
    "use_bfloat16": false,
    "use_cache": true,
    "vocab_size": 30524
  },
  "tie_word_embeddings": true,
  "transformers_version": "5.1.0",
  "use_cache": false,
  "vision_config": {
    "add_cross_attention": false,
    "attention_dropout": 0.0,
    "bos_token_id": null,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "dropout": 0.0,
    "dtype": "float32",
    "eos_token_id": null,
    "finetuning_task": null,
    "hidden_act": "gelu",
    "hidden_size": 768,
    "image_size": 384,
    "initializer_factor": 1.0,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "is_decoder": false,
    "layer_norm_eps": 1e-05,
    "model_type": "blip_vision_model",
    "num_attention_heads": 12,
    "num_channels": 3,
    "num_hidden_layers": 12,
    "pad_token_id": null,
    "patch_size": 16,
    "prefix": null,
    "projection_dim": 512,
    "pruned_heads": {},
    "sep_token_id": null,
    "task_specific_params": null,
    "tf_legacy_loss": false,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null,
    "torchscript": false,
    "use_bfloat16": false
  }
}
